{
    "description": "Working as an enforcer for organized crime in Las Vegas, the dark incarnation of the Hulk named Joe Fixit is morally ambiguous at best, and downright cruel at worst. Dressed impeccably in his trademark suits, Mr. Fixit enjoys the finer things in life, like money, women, gambling, and gunning down his enemies with his dual Tommy Guns. He may be a weaker version of the Hulk, but he more than makes up for it with his firepower and sinister intelligence.",
    "specials": {
        "1": {
            "name": "Place Your Bets",
            "description": "55% chance to inflict Bleed, dealing 33% of your Attack as direct damage over 5 seconds.",
            "note": "This attack has 6 potential Bleed triggers and allows up to 6 stacks of Bleed",
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "bleed"
            ]
        },
        "2": {
            "name": "Shorten the Odds",
            "description": "100% chance to Stun the opponent for 3 seconds.",
            "abilities": [
                "stun"
            ]
        },
        "3": {
            "description": "100% chance to inflict Bleed, dealing 245% of your Attack as direct damage over 3 seconds. ",
            "abilities": [
                "bleed"
            ]
        }
    },
    "signature": {
        "name": "Double Down",
        "description": "Mr. Fixit knows how to play the tables and swing the odds in his favor. Each time he rolls on Gambler’s Ruin, he has a (50 - 85%) chance to Double Down and gain a second poker suit for 7 seconds. The secondary effect only lasts 7 seconds. The secondary effect is just as strong as a standard effect from Gambler’s Ruin. Double Down has a chance to trigger each time you re-roll on Gambler’s Ruin. More rolls means more effect. ",
        "note": "Each Double Down effect will be unique from the first effect, meaning you won’t ever get 2 stacks of Hearts, Spades, Diamonds or Clubs."
    },
    "gameplay": {
        "description": "At the beginning of the fight and whenever he lands a Heavy attack, Joe gains a random poker suit and lets loose a different aspect of the gamma irradiated gangster he is. The effect lasts indefinitely and will only be replaced when Joe lands another Heavy Attack and rerolls This effect cannot be nullified as it is a passive ability."
    },
    "author": {
        "name": "Kabam",
        "profile": {
            "type": "spotlight",
            "name": "588478-Joe-Fixit-Champion-Spotlight"
        }
    }
}
