{
    "description": "The Vision has few flaws, and you'll be extremely hard pressed to find a player that won't throw him atop the ranks and argue with the fact that he's one of the best champions in the game. He's a blazing fast fighter with quick reflexes and response time. This allows rapid attacks, blocks and smooth combos that seamlessly link up and swiftly make moves on your opponent.",
    "grades": {
        "normal": "A",
        "awakened": "A+"
    },
    "gameplay": {
        "rating": 5,
        "style": "Offensive",
        "description": "Get to love dropping that L1. You're going to want to ensure the opponent can't build up energy and furthermore prevent them from using that energy against you. By locking them down and preventing your opponent from dropping an L3 on you, you have the ability to defeat stronger players with as much as twice the PI!",
        "abilities": [
            "poisonimmunity",
            "bleedimmunity"
        ]
    },
    "attack": {
        "rating": 4,
        "heavy": "The Vision drops one of the coolest heavy attacks in the game. Not only is it quick to deploy, but it packs a punch and looks sleek as it's unleashed.",
        "ranges": [
            "short"
        ]
    },
    "specials": {
        "1": {
            "rating": 5,
            "description": "This special is, well, special. It can be used to control the fight by preventing powerful opponents from using their specials. Although predictable and easy to block, it's a challenge to dodge due to its long range. Used properly within or at the end of a combo, you can execute and connect a majority of the time. Effectiveness dependent on opponents energy",
            "damagetypes": [
                "energy"
            ],
            "ranges": [
                "long"
            ],
            "name": "Microwave Radiation",
            "abilities": [
                "powerburn"
            ]
        },
        "2": {
            "rating": 5,
            "description": "Who doesn't love this special? Not only is it extremely quick and beastly powerful, but it drains the opponents energy too! Also a challenge to block if executed properly within or when ending a combo. Effectiveness dependent on opponents energy.",
            "damagetypes": [
                "energy",
                "physical"
            ],
            "ranges": [
                "short"
            ],
            "name": "Power Punch",
            "abilities": [
                "powerburn"
            ]
        },
        "3": {
            "rating": 3,
            "description": "Although it looks pretty awesome, you're better off and more effective using your L2 followed by dropping an L1.",
            "damagetypes": [
                "physical"
            ],
            "name": "Physical Disruption"
        }
    },
    "signature": {
        "rating": 3,
        "name": "Power Steal",
        "description": "Special attacks steals 20% of your opponents power!"
    },
    "author": {
        "name": "/u/dat_frisson",
        "type": "reddit",
        "profile": "dat_frisson"
    },
    "youtube": "bcw5LH5OZrA"
}