{
    "description": "Leader of the Hunt, Guardian of the Galaxy, Queen of Hel, Angel, Goddess. Angela is a woman of many titles. Born Aldrif Odinsdottir, the first child of Freyja and Odin, but raised as Angela by Loriel, handmaiden to the Queen of Angels, she has battled her way across the Galaxy. Now Angela has come to the Contest, perhaps the greatest challenge of martial skill and strength to be found in the Nine Realms, and beyond.",
    "youtube": "hewPAiIvvz4",
    "gameplay": {
        "description": "Passive\n\nFor each 10% of Max Health taken in damage, immediately gain a Resilience counter.\nWhen below 100% Max Health without an active Regeneration Buff, convert a Resilience counter into a Regeneration Buff, recovering 691.75 Health over 10 seconds.\nPassive\n\nAngela gains a Buff based on her current Power level.\nEach time Angela lands a Critical Hit she duplicates the Buff she’s being granted by her current Power level. This Buff has a Duration of 15 seconds, and a maximum of 1 stack(s) of each Buff can be Duplicated.\nLess than Special 1: Armor Up increasing Armor Rating by 666.67\nSpecial 1: Fury increasing Attack by 899.25\nSpecial 2: Precision increasing Critical Rating by 2000\nSpecial 3 : Aptitude increasing the effect of all Fury, Armor, and Precision Buffs by 50%."
    },
    "attack": {
        "heavy": "This attack receives 2000 additional Critical Rating."
    },
    "specials": {
        "1": {
            "description": "Sword of the Stars – Angela unleashes a powerful series of strikes with her sword Xiphos.",
            "note": "100% chance for Fury, increasing your Attack by 899.25 for 5 seconds. If there is already a Fury active on Angela, this effects lasts for 20 seconds instead."
        },
        "2": {
            "description": "Blades of Ichor – Angela dashes forward to employ the Blades separated, before combining them to strike again.",
            "note": "100% chance to Armor Up, increasing Armor Rating by 666.67 for 5 seconds. If there is already an Armor Up active on Angela, this effects lasts for 20 seconds instead."
        },
        "3": {
            "description": "Martial Mastery – Angela strikes with the Sword of the Stars forcing her opponent back, before drawing the Blades of Ichor to finish them.",
            "note": "Angela’s Attack is increased by 599.5 for each Buff active on her during this attack."
        }
    },
    "signature": {
        "description": "Battle Focus\nAs Angela enters combat she gains greater and greater focus, allowing each Buff active on her to reduce all Nullify abilities chance to trigger against her by 25%."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight"
    }
}