{
    "description": "The Mutant known as Bishop was born into a bleak alternate future in which the robot Sentinels wiped out most of the X-Men, and Mutants were branded with an “M” over their right eye for identification. After chasing a criminal through a time portal with no means to return to his own timeline, Bishop joined the X-Men.",
    "youtube": "MkZ9ZaXAcEI",
    "gameplay": {
        "description": "Persistent Power Meter\n\nBishop’s mastery over energy and time enables him to enter a fight with 100% of the Power he finished his previous fight in the same Quest with.\n\nEnergy Transference Passive\n\n+3882 Energy Resistance at all times.\nEnergy Attacks against Bishop generate 70% more Power plus 1 stack of Prowess.\nEnergy Damage abilities against Bishop have up to a 40% chance with each tick to generate 2% Power plus 1 stack of Prowess. No effect against the abilities of Tech Champions.\nAbsorb the kinetic energy of a well-timed Block to generate 5% Power plus 3 stacks of Prowess. Prowess gained in this way is doubled against Skill Champions and tripled against Energy-based Special Attacks. No effect against the attacks of Tech Champions.\n\nBlocking\n\nSteadily consume Prowess to Regenerate 97 Health per Prowess consumed.\nEach Prowess consumed has a 100% chance to Purify 1 Bleed Debuff(s).\nConsumption starts after a brief delay of holding block, and steadily pulls off 1 Prowess at a time to Regenerate and, if applicable, remove 1 Bleed Debuff.\n\nSpecial Attacks\n\nConsume all Prowess and gain +10% Special Damage per stack consumed.\n\nWarning: Power Overload!\n\n81 Health per second is lost for each Prowess above a stack of 30.\nIf Bishop stays at full Power for more than 9 seconds, he begins to overload and lose 97 Health per second until that Power is spent. The longer he stays at full Power, the more Health is lost.\nActivate any Special Attack to expel stored energy and avoid unnecessary damage!",
        "note": "If you exit a fight with two bars, you’ll start the next fight with two bars; however, don’t hoard your Power for too long, as Bishop will start losing Health if he waits too long before spending Power. More information on how Bishop overloads can be found below."
    },
    "specials": {
        "1": {
            "description": "Steady Release – A twin gun assault where Bishop unloads frequent energy bursts.",
            "note": "Up to 40% of this Energy Damage penetrates the enemy Block. Up to 80% of Basic Attack damage is replaced with bursts of Energy Damage for 15 seconds, allowing Bishop to mitigate Armor and abilities that reflect attack damage. This bonus Energy Damage increases by 6% for each Prowess consumed by Special 1."
        },
        "2": {
            "description": "Burst Release – Bishop’s stored energy is amplified and then released in a single burst.",
            "note": "+50% damage if activated within the first 12 seconds of a fight."
        },
        "3": {
            "description": "Diffusion Wave – As Bishop approaches his limit, he unleashes all stored energy at once in every direction.",
            "note": "+30% damage against enemies above 85% Health or below 15% Health. This increases to +70% damage against enemies at full Health"
        }
    },
    "signature": {
        "description": "Foresight – Gain a unique bonus based on how many bars of Power are full at the start of the fight.",
        "note": "Bishop prepares a unique bonus based on how many bars of Power are full at the start of the fight. With 0 Bars: Special Attacks become Unblockable with a stack of 10.01 or more Prowess. With 1 Bar: While Blocking, gain Stun Immunity and enemies lose 80% ability accuracy. With 2 Bars: Special Attacks leave the target Incinerated for 40% of the Special Damage Dealt over 5 seconds. With 3 Bars: Start the fight with Steady Release active for 15 seconds."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "champion-spotlight-bishop/"
    }
}