{
    "youtube": "jup-agcL4PE",
    "gameplay": {
        "abilities": [
            "regeneration",
            "incinerate",
            "directdamage"
        ],
        "description": "Techno Organic Repairs\n\n15% chance to Regenerate 15% Health for 10 seconds, each time a bar of Power is filled. This ability stops working below 25% Health.\n\nBelle\n\nOnce his Poison Durations are reduced to 0, Cable gains a Passive 50% bonus to Special Damage.\n\nTechno Organic Infection\n\nWhen caused to Bleed, Cable has a 100% chance to trigger his Heavy Attack Degeneration on his Opponent."
    },
    "attack": {
        "heavy": "100% Chance to Degenerate Non-Robotic opponents for up to 400% of your Attack over 15 seconds. Strength of Degenerate scales inverse of your Opponent’s current Power.",
        "damagetypes": [
            "physical"
        ]
    },
    "specials": {
        "1": {
            "name": "Short Controlled Bursts",
            "note": "This attack is Unblockable if you are currently under the effects of a True Strike Buff",
            "ranges": [
                "long",
                "long",
                "long"
            ],
            "damagetypes": [
                "energy"
            ]
        },
        "2": {
            "name": "Charge Shot",
            "description": "This attack Incinerates the enemy, dealing 100% of your Attack as Energy Damage over 10 seconds. This effect also removes Perfect Block Chance and reduces Block Proficiency by 50%.\n\nThis attack has a 84% chance to give the opponent a Concussion, reducing their Ability Accuracy by 78% for 11 seconds. The potency of this effect is affected by Class relationships.",
            "ranges": [
                "melee",
                "long"
            ],
            "damagetypes": [
                "physical",
                "energy"
            ],
            "abilities": [
                "incinerate"
            ]
        },
        "3": {
            "name": "TK Rifle",
            "note": "100% Chance to grant True Strike for 15 seconds. This allows him to ignore Armor, Resistances, and Evasion.",
            "abilities": [
                "directdamage"
            ],
            "damagetypes": [
                "energy"
            ]
        }
    },
    "signature": {
        "name": "Techno Organic Virus Suppression"
    },
    "author": {
        "type": "spotlight",
        "name": "Kabam",
        "profile": "708221-Champion-Spotlight-Cable"
    }
}