{
    "specials": {
        "1": {
            "name": "Shield Bash",
            "ranges": [
                "melee"
            ],
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "stun"
            ],
            "note": "30% chance to Stun opponents for 3 seconds. The chance to Stun is increased 40% if the target is Fatigued.",
            "rating": "4"
        },
        "2": {
            "name": "Shield Toss",
            "ranges": [
                "medium"
            ],
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "stun"
            ],
            "note": "30% chance to Stun opponents for 3 seconds. The chance to Stun is increased by 40% if the target is fatigued.",
            "rating": "5"
        },
        "3": {
            "name": "American Justice",
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "stun"
            ],
            "note": "30% chance to Stun opponents for 3 seconds. The chance to Stun is increased by 40% if the target is fatigued.",
            "rating": "3"
        }
    },
    "signature": {
        "name": "Last Stand",
        "rating": "4"
    },
    "author": {
        "name": "[S D F] JJW",
        "type": "reddit",
        "profile": "-JJW-"
    },
    "gameplay": {
        "abilities": [
            "fatigue",
            "stun"
        ],
        "note": "Blocking  \nBlocking reduces 28% additional damage from attacks. 20% chance that a Block reduces all damage.  \n\nBlocking  \nA Perfect Block has a 89% chance to Fatigue the opponent, lowering their Critical Hit Rate by 10% for 12 seconds.",
        "rating": "4",
        "description": "There's no debate, Captain America is a tank. He may not be exciting to play, but he is reliable and tough.  \n\nMost players already invest in a basic defense mastery setup with 8% Block Proficiency, and a point in Perfect Block. When blocking, Cap takes very little damage.  \n\nInvesting in Utility pays off big time with Cap. He is already highly likely to Stun an opponent, but with Stupefy, Petrify and Pacify you can extend the stun duration and reduce the frequency certain opponent abilities.  \n\nWith Cap, it is pretty easy to implement a solid stun-combo chain.  Build 2 to 2.5 bars of power with basic attacks. Parry to stun, MLLL and L2. Another MLLL combo should fill up your L1, and you can Stun and combo again."
    },
    "grades": {
        "normal": "A-",
        "awakened": "A"
    },
    "attack": {
        "damagetypes": [
            "physical"
        ],
        "ranges": [
            "melee"
        ]
    }
}