{
    "author": {
        "type": "spotlight",
        "name": "Kabam",
        "profile": "658886-Crossbones-Champion-Spotlight"
    },
    "specials": {
        "1": {
            "name": "Rout",
            "note": "100% chance for Fury, increasing your Attack by 45% for 8.5 seconds.",
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "fury"
            ],
            "ranges": [
                "short",
                "short"
            ]
        },
        "2": {
            "note": "This effect also removes Perfect Block Chance and reduces Block Proficiency by 50% while it’s active.",
            "name": "Incendiary Assault",
            "damagetypes": [
                "physical"
            ],
            "ranges": [
                "melee",
                "long",
                "long",
                "long"
            ],
            "abilities": [
                "incinerate"
            ]
        },
        "3": {
            "name": "Eye for an Eye",
            "damagetypes": [
                "physical"
            ],
            "note": "This attack instantly refreshes the cooldown timer on Overrun."
        }
    },
    "attack": {
        "description": "Crossbones’ hydraulic gauntlets allow him to overpower his enemies. Whenever he would strike with a Critical Hit, he instead gains Fury, increasing his Attack by 45% for 8.5 seconds.\n The Potency of Crossbones’ Fury effects are increased by up to 20% based on his Critical Damage. As his Critical Damage climbs, his Fury effects becomes more powerful.\n For each Fury effect active, Crossbones overpowers his opponent, decreasing their Defensive Ability Accuracy by 23% per Fury.",
        "note": "Crossbones’ Fury effects stack infinitely.",
        "damagetypes": [
            "physical"
        ],
        "abilities": [
            "fury"
        ]
    },
    "signature": {
        "name": "HYDRA Training",
        "description": "Whenever Brock Rumlow gets a Debuff, his brutal HYDRA training kicks in and allows him a (15 – 25%) chance to shrug it off and convert it into a Fury effect.",
        "abilities": [
            "fury"
        ],
        "note": "The chance is increased by 15% when fighting Science Champions, and decreased by 15% when fighting Mutant Champions."
    },
    "gameplay": {
        "description": "Overrun  To begin Overrun, Dodge back and hold Block for 2 seconds. Once activated, Overrun lasts 8 seconds before it must cool down.\n When Crossbones enters Overrun, he gains 3 Fury effects and suffers 50% reduced Armor and Block Proficiency for the duration of the Overrun.\n While Crossbones is in Overrun, his Offensive Power Gain increases by 40% and his Defensive Power Gain decreases by the same amount.",
        "abilities": [
            "fury",
            "incinerate"
        ],
        "note": "Offensive Power Gain is the amount of Power gained from striking the opponent. Defensive Power Gain is the amount of Power gained while being struck or while blocking."
    },
    "youtube": "ZGzKI1YBjqM"
}