{
    "description": "Neena Thurman a.k.a. Domino is the lucky result of an unlucky government weapons program designed to breed the perfect weapon. After escaping a top-secret facility with her mother, she honed her Mutant ability to manipulate probabilities and joined the mercenary group known as X-Force.",
    "gameplay": {
        "description": "Probability Field Passive\n\nAt the start of the fight, opponents lose 222 Critical Rating and Domino gains the same amount.\nAt the start of the fight, opponents lose 15% Ability Accuracy. Whenever one of Domino’s abilities fails to trigger, she gains +10% Ability Accuracy for 8 seconds.\nDomino’s Bleed abilities tend to strike vital points and have a chance to benefit from her Critical Damage bonuses equal to her Critical Chance.\nOpponents’ Bleed abilities tend to graze and have a 50% chance to expire after only 1 second(s). Whenever a Bleed expires prematurely, Domino is inspired and gains 10% of her maximum Power instantly.\n\nBlocking\n\nBenefit from up to +1333 Block Proficiency selected at random.\nA Block with 5407 Block Proficiency or higher results in a Perfect Block, reducing incoming attack damage to zero and granting 10% maximum Power instantly.\n\nWhen Filling a Bar of Power\n\n30% chance for Domino to gain a Lucky Passive. 25% of Domino’s current Combo Meter count is added to this chance.\n30% chance for opponents to suffer an Unlucky Passive. 25% of the opponents’ current Combo Meter count is added to this chance.\nLucky and Unlucky effects last for a random duration between 1 and 5 seconds plus 1.5 additional second(s) for each full Bar of Power at the time of activation.\nSkill Champions are always Unlucky.\nTech Champions are never Unlucky.\n\nLucky Passive\n\n+273 Critical Rating.\n+381 Critical Damage Rating.\n+15% Ability Accuracy.\n+353 Block Proficiency.\n10% chance to Evade attacks.\nStun expires 35% faster.\nDomino is more likely to earn a higher roll when selecting Attack Rating, Critical Damage Rating, and Block Proficiency bonuses at random.\n\nUnlucky Passive\n\n-273 Critical Rating.\n-276 Critical Damage Rating.\n-222 Critical Resistance.\n-35% Ability Accuracy.\n-353 Block Proficiency.\n100% chance for Evade or the Dexterity Mastery to fail.\nBleed abilities deal 50% less damage."
    },
    "attack": {
        "heavy": "If the opponent is Stunned, Attack Rating is increased by +1255 for this attack.",
        "description": "All Attacks\n\nBenefit from up to +502 Attack Rating selected at random.\nBenefit from up to +1333 Critical Damage selected at random.\nA Critical Hit with a maximum roll in both Attack and Critical Damage Ratings results in a Perfect Critical Hit that inflicts Stun for 1 to 3 second(s)."
    },
    "specials": {
        "1": {
            "description": "Stroke of Luck – Domino fires a bullet that strikes a grenade at exactly the right angle to maximize damage.",
            "note": "Each hit has a 25% chance to inflict Bleed, dealing 1381 damage over 7 seconds. If Domino is Lucky, this attack refreshes all Stun and Bleed effects on the opponent. If the opponent is Unlucky, this attack has +251 Attack Rating for each second that passed since the last time Domino hit with a Special Attack."
        },
        "2": {
            "description": "Auspicious Onslaught – Domino fires four shots in style while upside down and airborne.",
            "note": "Each hit has a 25% chance to inflict Bleed, dealing 3012 damage over 7 seconds. If Domino is Lucky, this attack has +1255 Attack Rating if Domino suffered from Bleed at least once this fight. If the opponent is Unlucky, they’re Taunted by this flashy attack. Taunted opponents have their Attack reduced by 251 and have a 70% higher chance to activate a Special Attack."
        },
        "3": {
            "description": "Soldier of Fortune – After two shots, Domino kicks her pistol at the opponent then unleashes a larger weapon.",
            "note": "74% chance to inflict Bleed, dealing 3012 damage over 7 seconds. If Domino is Lucky, this attack has +38 Attack Rating for every Critical Hit that occured this fight by either Domino or her opponent (Max: 100 Critical Hits). If the opponent is Unlucky, this attack inflicts Armor Break, removing one Armor Up and reducing Armor by 564 for 4 seconds."
        }
    },
    "signature": {
        "description": "Critical Failure\n\nOpponents take 753 Energy Damage over 1.5 second(s) whenever their abilities have a chance to trigger but don’t. Potency decreases temporarily for consecutive triggers."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-domino/"
    },
    "youtube": "Tk1V3W84eeI"
}