{
    "specials": {
        "1": {
            "name": "Fading Barrage",
            "note": "85% chance to inflict Bleed, dealing 103% of your Attack as direct damage over 3.5 seconds. The chance to trigger Bleed is increased by 15% if Redwing is Locked On. This Bleed has 1 potential trigger and stacks infinitely.",
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "bleed"
            ],
            "ranges": [
                "medium",
                "long"
            ]
        },
        "2": {
            "name": "Raptor Strike",
            "ranges": [
                "medium",
                "medium"
            ],
            "note": "Damage increases by up to 90% based on lost Health.",
            "damagetypes": [
                "physical"
            ]
        },
        "3": {
            "name": "Tango Down",
            "damagetypes": [
                "physical"
            ],
            "note": "This attack Incinerates the enemy, dealing 98% of your Attack as Energy Damage over 10 seconds. This effect also removes Perfect Block Chance and reduces Block Proficiency by 50% while it’s active. If Redwing is Locked On, an additional 20% Block Proficiency is removed.",
            "abilities": [
                "incinerate"
            ]
        }
    },
    "author": {
        "type": "spotlight",
        "name": "Kabam",
        "profile": "663153-Falcon-Champion-Spotlight"
    },
    "signature": {
        "name": "EXO-8",
        "description": "Redwing begins each fight ready to go. Additionally, Redwing’s Lock On lasts 2 seconds longer and provides an additional (5 - 16.5%) Critical Hit Chance.",
        "abilities": [
            "precision"
        ]
    },
    "gameplay": {
        "description": "Redwing remains Locked On to Science Champions for 20% longer than normal. Additionally, Redwing remains Locked On to Mutant Champions for 20% shorter than normal.\n Lock On is a Passive effect and does not trigger Willpower and other abilities that trigger from Debuffs. Defensive Ability Accuracy refers to abilities that are triggered by the Champion being attacked, such as Electro’s Static Shock or Iron Man’s Armor Up.\n\nFalcon’s scanning system in his goggles recalibrates each time the opponent triggers a Passive Evade, increasing Falcon’s Critical Damage by 37% until his next Critical Hit. This ability only triggers from a Passive Evade and will not trigger when the opponent uses the Dexterity mastery to evade an attack.\n The Cruelty Buffs gained are Passive and cannot be Nullified. Additionally, they stack infinitely until the next Critical Hit.",
        "note": "To begin a Recon Scan, Dodge back and hold Block for 2 seconds. While Locked On, the opponent’s Defensive Ability Accuracy is reduced by 100% for 10 seconds.",
        "abilities": [
            "cruelty"
        ]
    },
    "youtube": "ADUhCdUIC6E"
}