{
    "description": "You can’t fight what you don’t know, and nobody seems to know anything about who Ghost is or how she can do the things she can do. Feared and admired in the criminal underworld for her ability to phase through solid walls, Ghost’s true intentions are as elusive as she is, though one thing is for sure: she’s interested in getting her hands on all the Pym Tech she can find. Her advanced technology combined with her skill in combat make her a force to be reckoned with.​",
    "youtube": "r4-wJeKkvVw",
    "gameplay": {
        "description": "Dash Back \nBegin Phasing for 2 seconds. Phasing won’t activate if Ghost is afflicted with an Armor Break Debuff or has a Precision Passive.\n\nPhasing \nUpon Phasing, gain a Precision Passive for 6 seconds which guarantees the next hit to be Critical and consumes the Precision Passive. Ghost can only land Critical Hits through her abilities. \n- While Phasing, incoming attacks have a 100% chance to Miss and each Damage Over Time Debuff on Ghost converts to a Fury Passive increasing Attack Rating by 1294 for 5 seconds. \n- Phasing is immediately deactivated when Ghost initiates an attack or Blocks an attack."
    },
    "attack": {
        "description": "Critical Hits cannot be Evaded.\nNon-Critical Hits have a 10% chance to gain a Cruelty Buff increasing Critical Damage Rating by 1333.33 for 20 seconds. Cruelty Buffs stack up to 5.\nWhen the opponent Evades, gain a Precision Passive for 6 seconds.",
        "heavy": "50% chance for Fury, increasing your Attack by 647 for 10 seconds. The chance to gain a Cruelty Buff on a Heavy Non-Critical Hit increases the longer the Heavy Attack is charged."
    },
    "specials": {
        "1": {
            "description": "Spectral Strike – Ghost unleashes a flurry of precise attacks before advancing into a backflip kick.",
            "note": "Gain 3 Precision Passives for 6 seconds. When triggered immediately upon Phasing, each hit is a guaranteed Critical."
        },
        "2": {
            "description": "Exploit Weakness – Ghost catches the opponent off guard with kicks to the chest ending with a drop kick from above.",
            "note": "Gain a Cruelty Buff increasing Critical Damage Rating by 1333.33 for 20 seconds, then refresh all Cruelty Buffs generated by Ghost. When triggered immediately upon Phasing, each hit is a guaranteed Critical."
        },
        "3": {
            "description": "Relentless Onslaught – Ghost advances on the opponent, quickly Phasing in and out, avoiding their attacks and countering with her own.",
            "note": "Each Cruelty Buff generated by Ghost converts to a permanent Cruelty Passive. Cruelty Passives stack up to 5"
        }
    },
    "signature": {
        "description": "Quantum Augmentation – Improved technology provides Ghost greater control over Phasing. She begins the fight Phasing and while it’s active, opponent’s Missed attacks provide her Power.",
        "note": "At the start of the fight, begin Phasing for 2 seconds. When opponents Miss, generate 5% of Max Power per Miss."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-ghost/"
    }
}
