{
    "youtube": "1Iqna5igXEI",
    "gameplay": {
        "description": "Mordo’s astral form ensures that every ability properly activates, resisting against Ability Accuracy effects.\n\nMordo gets one bar of Power over 5 seconds, every 8 seconds. Opponents can interrupt the Power Gain when landing a hit on Mordo.\n\nAfter holding Block for 0.5 seconds, Mordo can block unblockable special attacks.",
        "note": "Even while Stunned, Mordo’s astral form senses incoming non-special attacks and quickly counter-attacks, inflicting Degeneration for 75% of your attack as direct damage over 2.5 seconds."
    },
    "attack": {
        "heavy": "Mordo gains 16.6% of max power per second while below 1 power bar. Exponentially gains up to 10 Fury stacks while charging a Heavy Attack, each charge increases his Attack by 15% for 12 seconds."
    },
    "specials": {
        "1": {
            "name": "Energy Blast",
            "description": "Causes Degeneration, inflicting 75% of your Attack as Direct Damage over 2.5 seconds. If the opponent has a Buff, Degeneration will activate even after a successful Block.",
            "abilities": [
                "degeneration",
                "stun"
            ],
            "damagetypes": [
                "energy"
            ],
            "ranges": [
                "long"
            ],
            "note": "30% Chance to Stun for 3 seconds."
        },
        "2": {
            "description": "Opponents suffer from Mordo’s Soul Barb spell for 14 seconds, 10% of your Attack per opponent Buff as Energy Damage. Additionally, Soul Barb reduces Health Recovery by 70%.",
            "name": "Astral Strike",
            "ranges": [
                "short",
                "medium"
            ],
            "damagetypes": [
                "physical"
            ]
        },
        "3": {
            "description": "Gains 3 stacks of Fury, each increasing his Attack by 43% for 12 seconds.",
            "name": "Mirror Realm",
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "fury",
                "regeneration"
            ],
            "note": "Up to 40% chance based on Health lost to Regen instead of gaining a Fury stack, Recovering 14% Health over 6 seconds."
        }
    },
    "signature": {
        "name": "Mystical Barrier",
        "abilities": [
            "energyresist"
        ]
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "686091-Champion-Spotlight-Mordo"
    }
}