{
    "specials": {
        "1": {
            "name": "Soul Strike",
            "ranges": [
                "melee"
            ],
            "damagetypes": [
                "physical",
                "energy"
            ],
            "abilities": [
                "nullify"
            ],
            "note": "100% chance to Nullify. If a Buff is removed in this way, an additional 50% Attack is dealt as Energy Damage. \n\n100% chance to enter a state of Limbo for the duration of these attacks. \n\nOpponents do not generate Power from these attacks.",
            "rating": "2"
        },
        "2": {
            "name": "Severance",
            "ranges": [
                "melee"
            ],
            "damagetypes": [
                "physical",
                "energy"
            ],
            "abilities": [
                "powerlock",
                "powersteal"
            ],
            "note": "70% chance to Power Lock, severing the target's flow of Power for 8 seconds. \n\n100% chance to Power Steal, taking 21% enemy Power as your own. 100% chance to enter a state of Limbo for the duration of these attacks. \n\nOpponents do not generate Power from these attacks.",
            "rating": "4"
        },
        "3": {
            "name": "Singularity",
            "damagetypes": [
                "physical",
                "energy"
            ],
            "abilities": [
                "nullify"
            ],
            "note": "100% chance to Nullify, removing all Buffs and increasing your Attack by 50% for each Buff removed. Opponents do not generate Power from these attacks.",
            "rating": "4"
        }
    },
    "gameplay": {
        "abilities": [
            "nullify",
            "powerlock",
            "powersteal",
            "limbo"
        ],
        "note": "Limbo \nDeals 25% Attack as Energy Damage per second. Any damage taken during this period is rewound when the effect expires.",
        "rating": "3",
        "description": "Unduped, Magik can devastate heavy buff opponents like Groot, Logan, and Venom with her L3.  She is, for all intents and purposes, immune to Yellowjacket's Power Sting, unless it kills her during the attack. The Power Sting effect always takes place during the Limbo window, so that damage is rewound when Limbo closes.  Anything to increase raw Attack increases damage.  Once awakened, Magik's chances of entering Limbo increase with her level of power, so look to put awakened Magik on Power Gain and Attack boosting tiles."
    },
    "signature": {
        "name": "Darkchilde",
        "description": "After filling a bar of Power, Magik has a 20% chance to enter a state of Limbo for 3 seconds. The chance increases by 12.5% after filling 2 bars, and by 25% after filling 3 bars.",
        "rating": "4",
        "abilities": [
            "limbo"
        ]
    },
    "author": {
        "name": "[S D F]",
        "type": "reddit",
        "profile": "/u/-JJW-"
    },
    "grades": {
        "normal": "B-",
        "awakened": "B+"
    },
    "attack": {
        "rating": "2"
    }
}