{
    "specials": {
        "1": {
            "name": "Skin-to-Skin",
            "description": "Rogue removes her gloves to absorb life energy, even against Blocking opponents.",
            "ranges": [
                "melee"
            ],
            "note": "Replicates 4 of the opponent's active Buffs. Replicated Buffs stay active as long as Rogue keeps touching the opponent. Opponents cannot activate those Buffs as long as Rogue holds them. \n\nRogue's Replicate effect does not work on opponents of the Tech Class. \n\nLife Steal deals 27.5% Attack as Direct Damage. Rogue is healed for 100% of the Life Stolen.",
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "directdamage",
                "healthsteal"
            ]
        },
        "2": {
            "description": "With the incredible physical strength absorbed from Ms. Marvel, Rogue aims three powerful punches at the enemies' face.",
            "name": "Face Punch",
            "note": "100% chance per hit to Power Steal, taking 8% of their Power as your own. (3 Hits total)",
            "ranges": [
                "melee"
            ],
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "healthsteal",
                "powersteal"
            ]
        },
        "3": {
            "name": "Lethal Kiss",
            "description": "Rogue initiates the attack by throwing the opponent into the air followed by aerial punches and a grand finale with her blowing a kiss towards the opponent.",
            "damagetypes": [
                "physical"
            ],
            "note": "100% chance to Power Steal, taking 24% of their Power as your own. \nActivates 1 Buff per type that was Replicated during the fight. \nBuffs stay active as long as Rogue keeps touching the opponent. \nOpponents can not activate those Buffs as long as Rogue holds them.",
            "abilities": [
                "powersteal"
            ]
        }
    },
    "signature": {
        "name": "Psyche Absorption",
        "description": "Absorbing the very fabric of her enemy's psyche, every Life or Power Steal has a 35% chance to be Critical, increasing the amount absorbed.",
        "abilities": []
    },
    "author": {
        "name": "[S D F] JJW",
        "type": "reddit",
        "profile": "-JJW-"
    },
    "gameplay": {
        "description": "Passive After absorbing the power of Carol Danvers, the original Ms. Marvel, Rogue possessed an amalgamated mutant/Kree physiology, decreasing the duration of Debuffs by 65%.",
        "abilities": [
            "directdamage",
            "healthsteal",
            "powersteal"
        ]
    },
    "description": "Rogue’s ability to absorb the life energy and psyche of others through touch emerged in a traumatizing accident when she was a young girl, where she left the victim in a coma. Though she originally viewed her mutant powers as a curse, she mastered control of them under the tutelage of the X-Men and would become one of the most powerful mutants to date.",
    "youtube": "etu9bV7ekLw"
}