{
    "grades": {
        "normal": "A-",
        "awakened": "A+"
    },
    "description": "Cast no evil eyes in the direction of Wanda Maximioff, aka the Scarlet Witch - the master of chaos magic.  Her powerful hexes influence probability - making the impossible erupt across reality. A former member of the Brotherhood of Evil Mutants, she is a long-time member of the Avengers. Wanda remains close with her twin brother, Quicksilver.",
    "gameplay": {
        "abilities": [
            "nullify",
            "precision"
        ],
        "rating": "5",
        "description": "And unawakened Scarlet Witch is competent against champions that proc abilities like Armor Up and Regen. Teamed with a Critical Rate boosting team (several combinations provide +14%), Scarlet which has a high chance of achieving Critical Hits, which in turn have a very high chance of nullifying the opponent buff.  \nHer L2 is very strong, but easily blocked or evaded. Your best strategy is to invest in Utility Masteries in order to prolong Stun effects.  Build an L2, parry-stun your opponent, and easily hit them for 5k damage.\n\nAn awakened Scarlet Witch is a whole new game. Critical Hits will now randomly buff Scarlet Witch and randomly debuff the opponent. It is not uncommon for an enemy to be perma-stunned for the duration of a fight."
    },
    "signature": {
        "name": "VEIL OF FORTUNE",
        "description": "Whenever a Critical Hit occurs for either player, there's a [16% to 100%] chance the Scarlet Witch manipulates the outcome for her benefit.",
        "rating": "5",
        "abilities": []
    },
    "specials": {
        "1": {
            "name": "Hex Sphere",
            "description": "A concentrated sphere of Chaos Magic blasts Scarlet Witch's opponents",
            "ranges": [
                "long"
            ],
            "damagetypes": [
                "energy"
            ],
            "abilities": [
                "precision"
            ],
            "note": "This attack receives 30% additional Critical Hit Rate.",
            "rating": "2"
        },
        "2": {
            "rating": "5",
            "name": "Hex Bolt",
            "description": "Scarlet Witch sends her opponents flying with a bolt of Chaos Magic.",
            "ranges": [
                "long"
            ],
            "damagetypes": [
                "energy"
            ],
            "abilities": [
                "precision"
            ],
            "note": "This attack receives 40% additional Critical Hit Rate."
        },
        "3": {
            "name": "Chaotic Bombardment",
            "description": "Scarlet Witch cuffs her foe into helplessness before crushing them with a bombardment of Hex Bolts",
            "damagetypes": [
                "energy"
            ],
            "abilities": [
                "nullify"
            ],
            "note": "100% chance to Nullify, removing all positive status effects from opponents.",
            "rating": "3"
        }
    },
    "author": {
        "name": "[S D F] JJW",
        "type": "reddit",
        "profile": "-JJW-"
    },
    "attack": {
        "ranges": [
            "melee"
        ],
        "damagetypes": [
            "energy"
        ],
        "abilities": [
            "nullify"
        ],
        "rating": "4",
        "note": "Critical Hits\nCritical Hits have an 87% chance to Nullify, removing 1 Buff(s) from the opponent."
    },
    "youtube": "Bg4y30CBaPU"
}