{
    "youtube": "ZBwLqkMc6q0",
    "specials": {
        "1": {
            "name": "X-Slash",
            "description": "This attack pierces 93% of the opponent’s Armor.",
            "ranges": [
                "medium"
            ],
            "damagetypes": [
                "physical"
            ]
        },
        "2": {
            "description": "31% chance to inflict Bleed, dealing 165% of your Attack as direct damage over 5.5 seconds.",
            "note": "This has 3 potential triggers and stacks up to 3 times.",
            "damagetypes": [
                "physical"
            ],
            "ranges": [
                "medium"
            ],
            "name": "Primal Rage",
            "abilities": [
                "bleed"
            ]
        },
        "3": {
            "name": "Kill Frenzy",
            "description": "100% chance to inflict Bleed, dealing 96% of your Attack as direct damage over 5.5 seconds.\n This attack causes Logan to snap and go Berserk, at the cost of one Pacifism charge.\n\nThis has 1 potential Bleed trigger.\n This attack immediately causes Logan to go Berserk (see below).",
            "note": "If Logan only has one Pacifism charge, he will lose that charge, but won’t go Berserk as he has no charges left to convert into Fury and Cruelty effects.",
            "damagetypes": [
                "physical"
            ],
            "abilities": [
                "bleed"
            ]
        }
    },
    "author": {
        "type": "spotlight",
        "profile": "636387-Old-Man-Logan-Champion-Spotlight",
        "name": "Kabam"
    },
    "signature": {
        "name": "Pop the Claws",
        "note": "The Bleed effects from Pop the Claws stacks infinitely and has a chance to trigger per Pacifism charge active.",
        "abilities": [
            "bleed"
        ]
    },
    "gameplay": {
        "abilities": [
            "fury",
            "precision",
            "cruelty",
            "regeneration"
        ],
        "description": "Each time Logan loses 10% of his max health, or the opponent uses a Special Attack against him, he gains a charge of Pacifism and has a 10% chance per charge to snap and go Berserk.\n Logan cannot gain a charge a multiple times if he drops below a health threshold more than once.\n When Logan goes Berserk, for each Pacifism charge he had, he gains one Fury and Cruelty effect, increasing Attack and Critical Damage by 19% per charge consumed.\n\nLogan’s advanced age has altered his Healing Factor, allowing him to recover 9 health twice per second. Additionally, any time he Bleeds, his Healing Factor closes the wound 79% faster.",
        "note": "If Logan’s Regeneration effect is Nullified or removed, it will stay down for 5 seconds before starting up again."
    }
}